configuration/src/Catalogs/MessageTemplates/MessageTemplates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>MessageTemplates</name>
  <basedOn>Document.OutgoingEmail</basedOn>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>TemplateOwner</name>
    <type>
      <types>DefinedType.MessageTemplateOwner</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalDataProcessor</name>
    <type>
      <types>CatalogRef.AdditionalReportsAndDataProcessors</types>
    </type>
  </attributes>
  <attributes>
    <name>AddAttachedFiles</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Purpose</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Sender</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SendInTransliteration</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SignatureAndSeal</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>InputOnBasisParameterTypeFullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ForSMSMessages</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ForInputOnBasis</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ForEmails</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSTemplateText</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MessageTemplateText</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>HTMLEmailTemplateText</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailSubject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EmailTextType</name>
    <type>
      <types>EnumRef.EmailEditingMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>AuthorOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TransliterateFileNames</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PackToArchive</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AttachmentFormat</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>TemplateByExternalDataProcessor</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PrintFormsAndAttachments</name>
    <attributes>
      <name>Id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Parameters</name>
    <attributes>
      <name>ParameterName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ParameterType</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ParameterPresentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Enums/EmailEditingMethods/EmailEditingMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>EmailEditingMethods</name>
  <enumValues>
    <name>NormalText</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/MessageTemplates/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If FillingData <> Undefined Then
		
		If Common.SubsystemExists("StandardSubsystems.Interactions")
			And TypeOf(FillingData) = Type("DocumentRef.OutgoingEmail") Then
				FillOnBasisOutgoingEmail(FillingData, FillingText, StandardProcessing);
		ElsIf TypeOf(FillingData) = Type("Structure") Then 
				FillBasedOnStructure(FillingData, FillingText, StandardProcessing);
		EndIf;
		
	EndIf;
EndProcedure

#EndRegion

#Region Private

Procedure FillOnBasisOutgoingEmail(FillingData, FillingText, StandardProcessing)
	
	EmailSubject                             = FillingData.Subject;
	HTMLEmailTemplateText                 = FillingData.HTMLText;
	MessageTemplateText                     = FillingData.Text;
	EmailSubject                             = FillingData.Subject;
	Description                           = FillingData.Subject;
	ForEmails        = True;
	ForSMSMessages                     = False;
	InputOnBasisParameterTypeFullName = NStr("en = 'Common';");
	EmailTextType = Enums.EmailEditingMethods.NormalText;
	
	If Common.SubsystemExists("StandardSubsystems.EmailOperations") Then
		ModuleEmailOperationsInternal = Common.CommonModule("EmailOperationsInternal");
		HTMLEmailsTextTypes = ModuleEmailOperationsInternal.EmailTextsType("HTML");
		HTMLEmailsWithPicturesTextsTypes = ModuleEmailOperationsInternal.EmailTextsType("HTMLWithPictures");
		
		If FillingData.TextType = HTMLEmailsTextTypes
			Or FillingData.TextType = HTMLEmailsWithPicturesTextsTypes Then
			EmailTextType = Enums.EmailEditingMethods.HTML;
		EndIf;
	
	EndIf;
	
EndProcedure

Procedure FillBasedOnStructure(FillingData, FillingText, StandardProcessing)
	
	TemplateParameters = MessageTemplates.TemplateParametersDetails();
	CommonClientServer.SupplementStructure(TemplateParameters, FillingData, True);
	
	FillPropertyValues(ThisObject, TemplateParameters);
	AttachmentFormat = New ValueStorage(TemplateParameters.AttachmentsFormats);
	
	If TypeOf(FillingData) = Type("Structure")
		And FillingData.Property("ForSMSMessages")
		And FillingData.ForSMSMessages Then
			TemplateParameters.TemplateType = "SMS";
	EndIf;
	
	If ValueIsFilled(TemplateParameters.ExternalDataProcessor) Then
		TemplateByExternalDataProcessor = True;
	EndIf;
	
	If ValueIsFilled(TemplateParameters.FullAssignmentTypeName) Then
		ObjectMetadata = Common.MetadataObjectByFullName(TemplateParameters.FullAssignmentTypeName);
		InputOnBasisParameterTypeFullName = TemplateParameters.FullAssignmentTypeName;
		Purpose= ObjectMetadata.Presentation();
		ForInputOnBasis = True;
	EndIf;
	
	If TemplateParameters.TemplateType = "MailMessage" Then
		
		ForSMSMessages              = False;
		ForEmails = True;
		EmailSubject                      = TemplateParameters.Subject;
		
		If TemplateParameters.EmailFormat1 = Enums.EmailEditingMethods.HTML Then
			HTMLEmailTemplateText = StrReplace(TemplateParameters.Text, Chars.LF, "<BR>");
			EmailTextType        = Enums.EmailEditingMethods.HTML;
		Else
			MessageTemplateText = StrReplace(TemplateParameters.Text, "<BR>", Chars.LF);
			EmailTextType    = Enums.EmailEditingMethods.NormalText;
		EndIf;
		
	ElsIf TemplateParameters.TemplateType = "SMS" Then
		
		ForSMSMessages              = True;
		ForEmails = False;
		SMSTemplateText                 = TemplateParameters.Text;
		SendInTransliteration            = TemplateParameters.Transliterate;
		
	ElsIf TemplateParameters.TemplateType = "Shared" Then
		
		ForSMSMessages              = False;
		ForEmails = False;
		
	EndIf;
	
	If TypeOf(TemplateParameters.PrintCommands) = Type("Array") Then
		
		For Each PrintCommand In TemplateParameters.PrintCommands Do
			String = PrintFormsAndAttachments.Add();
			String.Id = PrintCommand;
		EndDo;
		
	EndIf;
	
EndProcedure

#EndRegion

#Else
Raise NStr("en = 'Invalid object call on the client.';");
#EndIf
